app/controllers/stats_controller.rb

SELECT * FROM "stats" WHERE ("stats"."id" = 0)
---
  def show
    @stat = Stat.find(params[:id])

SELECT * FROM "years" WHERE ("years"."year" = '1998') LIMIT 1
INSERT INTO "years" ("created_at", "updated_at", "year", "description") VALUES('2010-06-07 01:41:43', '2010-06-07 01:41:43', '1998', NULL)
SELECT * FROM "leagues" WHERE ("leagues"."league_name" = 'American') LIMIT 1
INSERT INTO "leagues" ("created_at", "updated_at", "league_name") VALUES('2010-06-07 01:41:48', '2010-06-07 01:41:48', 'American')
SELECT * FROM "divisions" WHERE ("divisions"."division_name" = 'East') LIMIT 1
INSERT INTO "divisions" ("division_name", "league_id", "created_at", "updated_at") VALUES('East', 1, '2010-06-07 01:41:52', '2010-06-07 01:41:52')
SELECT * FROM "teams" WHERE ("teams"."team_name" = 'Orioles') LIMIT 1
INSERT INTO "teams" ("created_at", "updated_at", "team_city", "team_name", "division_id") VALUES('2010-06-07 01:41:56', '2010-06-07 01:41:56', 'Baltimore', 'Orioles', 1)
---
	def import_xml
    require "rexml/document"
    file=params[:document][:file]
    doc=REXML::Document.new(file.read)

		doc.elements.each("//SEASON") do |season|
			year = season.elements['YEAR'].text
			imp_year = Year.find_by_year( year )
			if not imp_year
				imp_year = Year.create(:year => year)
			end

			season.elements.each("//LEAGUE") do |league|
				league_name = league.elements['LEAGUE_NAME'].text
				imp_league = League.find_by_league_name( league_name )
				if not imp_league
					imp_league = League.create(:league_name => league_name)
				end

				league.elements.each("//DIVISION") do |division|
					division_name = division.elements['DIVISION_NAME'].text
					imp_division = Division.find_by_division_name( division_name )
					if not imp_division
						imp_division = Division.create(:division_name => division_name, :league_id => imp_league.id)
					end

					division.elements.each("//TEAM") do |team|
						team_city = team.elements['TEAM_CITY'].text
						team_name = team.elements['TEAM_NAME'].text
						imp_team = Team.find_by_team_name( team_name )
						if not imp_team
							imp_team = Team.create( :team_city => team_city, :team_name => team_name, :division_id => imp_division.id )

SELECT * FROM "players" WHERE (given_name = 'Bobby' and surname = 'Orr' and position = 'Shortstop') LIMIT 1
INSERT INTO "players" ("position", "created_at", "updated_at", "given_name", "surname") VALUES('Second Base', '2010-06-07 02:33:30', '2010-06-07 02:33:30', 'Roberto', 'Alomar')
SELECT * FROM "stats" WHERE (year_id = 1 and player_id = 1 and team_id = 1) LIMIT 1
INSERT INTO "stats" ("runs", "created_at", "rbi", "updated_at", "sb", "player_id", "avg", "ops", "year_id", "team_id", "hr") VALUES(86, '2010-06-07 02:33:31', 56, '2010-06-07 02:33:31', 18, 1, 0.282312925170068, 0.62940772639331, 1, 1, 14)
---

								puts "HOME RUNS: #{home_runs.to_i}"

								imp_player = Player.find(:first, :conditions => ["given_name = ? and surname = ? and position = ?", given_name, surname, position])
								if not imp_player
									imp_player = Player.create(:given_name => given_name, :surname => surname, :position => position)
								end

#								imp_stat = Stat.find(:all, :conditions => ["imp_year.id = :year_id and imp_player.id = :player_id and imp_team.id = :team_id"])
								imp_stat = Stat.find(:first, :conditions => ["year_id = ? and player_id = ? and team_id = ?", imp_year.id, imp_player.id, imp_team.id])
								if not imp_stat
									imp_stat = Stat.create(:year_id => imp_year.id, :player_id => imp_player.id, :team_id => imp_team.id,
																					:avg => avg, :hr => home_runs, :rbi => rbi, :runs => runs, :sb => steals, :ops => ops)